Revit 2026 API

# WallCrossSection Property

---

Gets or sets the Cross-section for this wall.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WallCrossSection CrossSection { get; set; }
```
```vb
Public Property CrossSection As WallCrossSection
	Get
	Set
```
```cpp
public:
property WallCrossSection CrossSection {
	WallCrossSection get ();
	void set (WallCrossSection value);
}
```
```fsharp
member CrossSection : WallCrossSection with get, set
```

#### Property Value

WallCrossSection

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The current wall does not support the cross section wallCrossSection. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This value determines whether the wall is vertical, slanted or tapered. See also: WallCrossSection. Setting the value to "SingleSlanted" or "Tapered" will enable other parameters to control the slanted angle(s) for a slanted or a tapered wall.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace